"""
Реализовать структуру «Рейтинг», представляющую собой не возрастающий
набор натуральных чисел. У пользователя необходимо запрашивать новый элемент
рейтинга. Если в рейтинге существуют элементы с одинаковыми значениями, то
новый элемент с тем же значением должен разместиться после них.
Подсказка.
Например, набор натуральных чисел: 7, 5, 3, 3, 2.
Пользователь ввел число 3. Результат: 7, 5, 3, 3, 3, 2.
Пользователь ввел число 8. Результат: 8, 7, 5, 3, 3, 2.
Пользователь ввел число 1. Результат: 7, 5, 3, 3, 2, 1.
Набор натуральных чисел можно задать непосредственно в коде,
например, my_list = [7, 5, 3, 3, 2].
"""

my_list = [9, 8, 6, 5, 5]
number = int(input("Введите новый элемент рейтинга: "))
for el in my_list:
    if number > my_list[0]:
        my_list.insert(0, number)
        break
    elif number < my_list[-1]:
        my_list.append(number)
        break
    elif number == el:
        i = my_list.index(el)
        my_list.insert(i + 1, number)
print(f"{my_list}")
